import { useEffect, useState } from "react";
import { useNavigate, useParams } from "react-router-dom";
import styled from "styled-components";
import Arrow from "../assets/svg/accordionArrow.svg";

// Types
interface TextProps {
  paddingTop?: string;
}

// Styled Components
const HelpWrapper = styled.div`
  width: 100%;
  margin-top: 20px;
  color: black;
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: column;
`;

const Container = styled.div`
  max-width: 1440px;
  display: flex;
  justify-content: center;
  align-items: center;
`;

const ListWrapper = styled.div`
  display: none;
  @media (min-width: 992px) {
    display: flex;
    justify-content: center;
    align-items: start;
    flex-direction: column;
    width: 30%;
    padding: 0px 15px;
  }
`;

const TextWrapper = styled.div`
  width: 100%;
  @media (min-width: 992px) {
    width: 70%;
  }
`;

const Title = styled.p`
  width: 100%;
  color: grey;
  font-size: 20px;
  padding: 17px 0px;
  text-align: center;
`;

const Text = styled.p<TextProps>`
  color: black;
  font-size: 16px;
  padding-top: ${(props) => props.paddingTop || "15px"};
  margin: 0px 20px;
  a {
    color: blue;
    text-decoration: underline;
    cursor: pointer;
  }
`;
interface ListItemsProps {
  tabIndex?: string;
}

const ListItem = styled.div<ListItemsProps>`
  display: flex;
  justify-content: start;
  align-items: center;
  padding: 10px 10px;
  width: 100%;
  cursor: pointer;
  outline: none;

  img {
    width: 15px;
    height: 15px;
    transform: rotate(-90deg);
  }

  &:hover,
  &:active,
  &:focus {
    color: #e85257;

    p {
      color: #e85257;
    }

    img {
      filter: invert(27%) sepia(51%) saturate(2878%) hue-rotate(346deg)
        brightness(104%) contrast(97%);
    }
  }
`;

type ContentMap = {
  [key: string]: JSX.Element;
};

// Component
export default function Help() {
  const { topic } = useParams<{ topic: string }>();
  const navigate = useNavigate();
  const [selectedItem, setSelectedItem] = useState<string>(
    topic || "Plus ქულებით შეძენა"
  );
  useEffect(() => {
    if (topic && listItems.includes(topic)) {
      setSelectedItem(topic);
    }
  }, [topic]);

  const listItems = [
    "Plus ქულებით შეძენა",
    "კომპანიის შესახებ",
    "ონლაინ განვადება",
    "ვებგვერდის მოხმარების წესები და პირობები",
    "მიწოდების პირობები",
    "საგარანტიო ტალონი",
    "საგარანტიო ტალონი იურიდიული პირებისთვის",
    "პროდუქციის შეკეთების, გადაცვლის და დაბრუნების პოლიტიკა",
    "კორპორატიული გაყიდვები",
    "Electrolux-ის საგარანტიოს რეგისტრაცია",
    "ონლაინ შეძენა",
    "Cookie პოლიტიკა",
    "კონფიდენციალობის პოლიტიკა",
    "Tax Free",
  ];

  const contentMap: ContentMap = {
    "Plus ქულებით შეძენა": (
      <>
        <Title>Plus ქულებით შეძენა</Title>
        <Text>
          მეგასთორი PLUS-ის პარტნიორი მაღაზიათა ქსელია, შესაბამისად თქვენ
          შეძლებთ PLUS ქულებით ტექნიკის შეძენას.
        </Text>
        <Text>
          PLUS ქულებით ონლაინ შეძენისთვის, ჩვენს ონლაინ მაღაზიაში რეგისტრაციის
          შემდგომ: აირჩიეთ სასურველი პროდუქტი დააჭირეთ ღილაკს "იყიდე" მიუთითეთ
          მიწოდების მისამართი გაეცანით და შემდეგ დაეთანხმეთ მომსახურების წესებსა
          და პირობებს აირჩიეთ საქართველოს ბანკის გადახდის არხი აირჩიეთ ბარათით
          გადახდა შეიყვანეთ ბარათის მონაცემები აირჩიეთ "გადაიხადეთ PLUS"
        </Text>
        <Text>მადლობა შენაძენისთვის!</Text>
      </>
    ),
    "კომპანიის შესახებ": (
      <>
        <Title>კომპანიის შესახებ</Title>
        <Text>
          „მეგასთორი" მაღაზიათა ქსელი წარმატებით მოღვაწეობს საქართველოში
          საყოფაცხოვრებო ტექნიკის ბაზარზე.
        </Text>
        <Text>
          „მეგასთორი" -ით სარგებლობისას თქვენ შეგიძლიათ მიიღოთ შეკვეთა
          საქართველოს 12 ქალაქში: თბილისი, რუსთავი, ქუთაისი, ბათუმი, ზუგდიდი,
          თელავი, გორი, გურჯაანი, ახალციხე, წნორი, ხაშური, ბორჯომი.
        </Text>
      </>
    ),
    "ონლაინ განვადება": (
      <>
        <Title>ონლაინ განვადება</Title>
        <Text>
          „მეგასთორი" ონლაინ მაღაზიაში თქვენ შეგიძლიათ მარტივად და კომფორტულად
          შეიძინოთ სასურველი პროდუქცია ონლაინ განვადებით.
        </Text>
        <Text>
          განავადეთ სასურველი ტექნიკა სასურველ დროს და ადგილას, თქვენი
          სმარტფონის ან ნოუთბუქის საშუალებით, სახლიდან, სამსახურიდან,
          საქართველოს ნებისმიერი წერტილიდან.
        </Text>
      </>
    ),
    "ვებგვერდის მოხმარების წესები და პირობები": (
      <>
        <Title>ვებგვერდის მოხმარების წესები და პირობები</Title>
        <Text>
          ვებგვერდის მოხმარების წესები და პირობები გთხოვთ, ვებგვერდის მეშვეობით
          ნივთის შეძენამდე ყურადღებით გაეცნოთ ვებგვერდის მოხმარების ქვემოთ
          მოცემულ წესებსა და პირობებს. თუ თქვენ არ ეთანხმებით აღნიშნულს,
          ვალდებული ხართ დაუყოვნებლივ შეწყვიტოთ ვებგვერდით სარგებლობა. ნივთის
          შეძენისას ყიდვის ღილაკზე დაკლიკებით, თქვენ ავტომატურ რეჟიმში
          ეთანხმებით წინამდებარე შეთანხმების დებულებებს.
        </Text>
        <Text>ტერმინთა განმარტება</Text>
        <Text>
          კომპანია- შპს ,,მეგასთორი“ /სავაჭრო ნიშნით ,,მეგასთორი“/; თბილისი,
          ბესარიონ ჟღენტის #84; ელ.ფოსტა: iraklijanashvili1999@gmail.com; tel.
          592 239 179. ვებ-გვერდი- კომპანიის ვებ-გვერდი - megastore.ge, რომლის
          მეშვეობითაც ხდება მომხმარებელთა მომსახურება; ნივთი- კომპანიის სავაჭრო
          ქსელში არსებული ნივთები; ნივთისშეძენა - ნივთის (პროდუქციის)
          ონლაინშეძენა; მომხმარებელი- ფიზიკური ან იურიდიული პირი, რომელიც
          ვებგვერდზე რეგისტრაციის გზით ეთანხმება წინამდებარე წესებსა და პირობებს
          ან/და აწარმოებს კომუნიკაციას კომპანიასთან ნივთის შეძენის მიზნით;
          შეთანხმება- მომხმარებელს და კომპანიას შორის გაფორმებული ხელშეკრულება,
          რომელიც მოიცავს ვებგვერდის მოხმარების წინამდებარე წესებსა და პირობებს
          (მის დანართებს, ასეთის არსებობის შემთხვევაში), ონლაინ შეძენის
          პირობებს, ონლაინ განვადების პირობებს, მიწოდების პირობებს, საგარანტიო
          მომსახურების პირობებს, TAX FREE სერვისით სარგებლობის პირობებს,
          პროდუქციის შეკეთების/გადაცვლის/დაბრუნების პოლიტიკას და
          კონფიდენციალობის პოლიტიკას.
        </Text>
      </>
    ),
    "მიწოდების პირობები": (
      <>
        <Title>მიწოდების პირობები</Title>
        <Text>
          კომპანია გთავაზობთ მიწოდების სერვისს შემდეგი ქალაქების - თბილისის,
          რუსთავის, ქუთაისისა და ბათუმის მასშტაბით. ხსენებულ ქალაქებში მიწოდების
          ვადა განისაზღვრება 1-5 სამუშაო დღით.
        </Text>
        <Text>
          რეგიონებში მიწოდება, ასევე, იმ შემთხვევებში, როცა ნივთი რეგიონიდან
          მომხმარებელს ზემოაღნიშნულ რომელიმე ქალაქში მიეწოდება, მიწოდების ვადა
          განისაზღვრება 5-14 სამუშაო დღით. მიწოდების ფასის შესახებ მომხმარებელს
          ეცნობება შეკვეთის განთავსებამდე.
        </Text>
        <Text>
          თუ კომპანიამ ვერ უზრუნველყო ზემოაღნიშნულ ვადაში საქონლის მოწოდება,
          მომხმარებელი უფლებამოსილია განუსაზღვროს კომპანიას მიწოდების დამატებითი
          გონივრული ვადა და ამ ვადის უშედეგოდ გასვლის შემდგომ უარი თქვას
          ხელშეკრულებაზე.
        </Text>
        <Text>
          შეკვეთის მიწოდებამდე მინიმუმ 1 საათით ადრე, მოვაჭრე ვალდებულია,
          სატელეფონო ზარის საშუალებით მომხმარებელს აცნობოს მიწოდების დრო.
        </Text>
        <Text>
          მომხმარებლის მიზეზით (არ პასუხობს ტელეფონს, არ იმყოფება მიწოდების
          მისამართზე, არაზუსტი მისამართის მითითება და ა.შ.) მიწოდების
          შეუძლებლობის შემთხვევაში, კომპანია ნივთს დააბრუნებს საწყობში, რომლის
          ტრანსპორტირების (ადგილზე წაღების) ხარჯი მომხმარებელმა თავად უნდა
          გასწიოს. შესაძლებელია, მოვაჭრის მიერ ნივთის მიწოდება განხორციელდეს
          განმეორებით, თუ მომხმარებელი ადგილზე ნივთის მიტანისას, დამატებით
          გადაიხდის მიტანის საფასურს.
        </Text>
        <Text>
          მომხმარებელი უფლებამოსილია არ ისარგებლოს მიტანის სერვისით და თავად
          გაიტანოს შეძენილი ნივთი კომპანიის საწყობიდან.
        </Text>
        <Text>კომპანია არ ახორციელებს შეძენილი ნივთის მონტაჟს.</Text>
      </>
    ),
    "საგარანტიო ტალონი": (
      <>
        <Title>საგარანტიო ტალონი</Title>
        <Text>
          გთხოვთ, გაიარეთ კონსულტაცია ჩვენს კომპანიასთან შეძენამდე, რათა
          დააზუსტოთ, აქვს თუ არა თქვენს მიერ არჩეულ პროდუქტს გარანტია. ყველა
          პროდუქტს არ აქვს გარანტია, ამიტომ აუცილებელია წინასწარი დადასტურება
        </Text>
      </>
    ),
    "საგარანტიო ტალონი იურიდიული პირებისთვის": (
      <>
        <Title>საგარანტიო ტალონი იურიდიული პირებისთვის</Title>
        <Text>
          გთხოვთ, გაიარეთ კონსულტაცია ჩვენს კომპანიასთან შეძენამდე, რათა
          დააზუსტოთ, აქვს თუ არა თქვენს მიერ არჩეულ პროდუქტს გარანტია. ყველა
          პროდუქტს არ აქვს გარანტია, ამიტომ აუცილებელია წინასწარი დადასტურება
        </Text>
      </>
    ),
    "პროდუქციის შეკეთების, გადაცვლის და დაბრუნების პოლიტიკა": (
      <>
        <Title>პროდუქციის შეკეთების, გადაცვლის და დაბრუნების პოლიტიკა</Title>
        <Text>
          პროდუქციის შეკეთების, გადაცვლის და დაბრუნების პოლიტიკა ,იმ შემთხვევაში
          თუ პროდუქტს აქვს გარანტია
        </Text>

        <Text>კანონისმიერი გარანტია</Text>
        <Text>
          თუ საქონელი ნაკლის მქონე აღმოჩნდა, მომხმარებელს უფლება აქვს, მოვაჭრეს
          მოსთხოვოს ნაკლის აღმოფხვრა (საქონლის უსასყიდლოდ შეკეთება ან შეცვლა,
          ფასის შემცირება) ან გავიდეს ხელშეკრულებიდან
        </Text>
        <Text>
          საქონლის შეკეთება და შეცვლა მომხმარებლის პირველი რიგის უფლებებია.
          მომხმარებელს უფლება აქვს, მოვაჭრეს მოსთხოვოს საქონლის უსასყიდლოდ
          შეკეთება ან შეცვლა, გარდა იმ შემთხვევისა, როდესაც ეს, საქონლის
          ბუნებიდან გამომდინარე, შეუძლებელია ან არათანაზომიერ ან შეუსაბამოდ დიდ
          ხარჯს მოითხოვს.
        </Text>
        <Text>
          საქონელი შეკეთებული ან შეცვლილი უნდა იქნეს გონივრულ ვადაში, ისე, რომ
          მომხმარებელს არ შეექმნას მნიშვნელოვანი შეფერხება საქონლის ბუნებისა და
          იმ მიზნის გათვალისწინებით, რომლისთვისაც მან ეს საქონელი შეიძინა.
        </Text>
        <Text>
          საქონლის უსასყიდლოდ შეკეთება ან შეცვლა გულისხმობს მოვაჭრის მიერ ყველა
          ხარჯის (მათ შორის, ფოსტის, სამუშაო ძალისა და მასალების ხარჯების)
          გაწევას, რომლებიც საჭიროა საქონლის ხელშეკრულებით გათვალისწინებულ
          პირობებთან შესაბამისობის უზრუნველსაყოფად.
        </Text>
        <Text>
          მომხმარებელს უფლება აქვს, მოითხოვოს საქონლის ფასის შემცირება ან უარი
          თქვას ხელშეკრულებაზე, თუ არსებობს ერთ-ერთი შემდეგი პირობა:
        </Text>
        <Text> ა{")"} საქონლის შეკეთება ან შეცვლა შეუძლებელია;</Text>
        <Text>
          ბ{")"} მოვაჭრემ საქონელი გონივრულ ვადაში არ შეაკეთა ან არ შეცვალა და
          მომხმარებელმა ხელშეკრულების შესრულებისადმი ინტერესი დაკარგა;
        </Text>
        <Text>
          გ{")"} მოვაჭრის მიერ საქონლის შეკეთება ან შეცვლა მომხმარებელს
          მნიშვნელოვან შეფერხებას შეუქმნის.
        </Text>
      </>
    ),
    "კორპორატიული გაყიდვები": (
      <>
        <Title>საგარანტიო ტალონი იურიდიული პირებისთვის</Title>
        <Text>
          კორპორატიული გაყიდვებისთვის მოგვწერეთ iraklijanashvili1999@gmail.com
        </Text>
        <Text>ან დაგვირეკეთ : 592 239 179</Text>
      </>
    ),
    "Electrolux-ის საგარანტიოს რეგისტრაცია": (
      <>
        <Title>Electrolux-ის საგარანტიოს რეგისტრაცია</Title>
        <Text>
          საგარანტიოს მისაღებად დაასკანერეთ QR კოდი ან გაიარეთ რეგისტრაცია
          ბმულზე / Scan QR code or go to link:
        </Text>
        <Text>
          AEG -{" "}
          <a href="https://ge.regulus-elux.eu/warranty/aae" target="_blank">
            https://ge.regulus-elux.eu/warranty/aae
          </a>
        </Text>
        <Text>
          Electrolux -{" "}
          <a href=" https://ge.regulus-elux.eu/warranty/aad" target="_blank">
            https://ge.regulus-elux.eu/warranty/aad
          </a>
        </Text>
      </>
    ),
    "ონლაინ შეძენა": (
      <>
        <Title>ონლაინ შეძენა</Title>
        <Text>
          ,,მეგასთორი'' ონლაინ შეძენის მარტივ, სწრაფ და კომფორტულ სისტემას
          გთავაზობთ ადგილზე მიწოდებით მთელი საქართველოს მასშტაბით.
        </Text>
        <Text>
          ონლაინ შეძენა შესაძლებელია 24 საათის განმავლობაში, თქვენი
          კომპიუტერიდან, სმარტფონიდან თუ ტაბლეტიდან, სახლიდან გაუსვლელად,
          სასურველ დროსა და ადგილას.
        </Text>
        <Text>
          1. დარეგისტრირდით და ავტორიზაცია გაიარეთ საიტზე ნივთის შერჩევამდე ან
          შემდგომ
        </Text>
        <Text>
          2. რეგისტრაციის დროს შეავსეთ ყველა ველი და აუცილებლად მიუთითეთ:
        </Text>

        <Text>სახელი და გვარი</Text>

        <Text>ტელეფონის ნომერი</Text>
        <Text>მისამართი, სადაც გნებავთ ნივთის მიწოდება</Text>
        <Text>
          გთხოვთ, ზუსტად მიუთითოთ ყველა ეს ინფორმაცია რომ ადგილზე მიწოდება
          შეფერხებების გარეშე განხორციელდეს.
        </Text>
        <Text>
          3. გადახდისთვის შეგიძლიათ გამოიყენოთ საქართველოში მოქმედი ნებისმიერი
          ბანკის მიერ გამოშვებული Visa, Master Card ან American Exspress
          ბარათები
        </Text>
        <Text>
          4. მეგატექნიკის ვებ გვერდზე სასურველი ნივთის ბარათით შეძენისას
          არანაირი დამატებითი საკომისიო არ არის გადასახდელი!
        </Text>

        <Text>
          გადახდა ხორციელდება საქართველოს ბანკის უსაფრთხო გადახდების სისტემით,
          რაც საშუალებას გვაძლევს არ შევინახოთ საკრედიტო ბარათების ნომრები და
          შესაბამისად დაცული იყოს თქვენი კონფიდენციალურობა.
        </Text>
        <Text>
          შენაძენის ადგილზე მიწოდება განხორციელდება კლიენტთან შეთანხმებული დროის
          შუალედში, 16 სამუშაო დღის ვადაში საქართველოს რეგიონის შესაბამისად.
        </Text>
      </>
    ),
    "Cookie პოლიტიკა": (
      <>
        <Title>Cookie პოლიტიკა</Title>
        <Text>
          ჩვენი ვებგვერდის მოხმარებით თქვენ მკაფიოდ და ცალსახად აცხადებთ
          თანხმობას კომპანიის მიერ დამუშავდეს თქვენი პერსონალური მონაცემები
          cookie ტექნოლოგიით. ჩვენი ვებგვერდის გამოყენების დაწყებამდე, ჩვენ უნდა
          მივიღოთ თქვენგან თანხმობა cookie ფაილების გამოყენების შესახებ. თქვენს
          მიერ ვებგვერდის გამოყენების გაგრძელება მიიჩნევა თანხმობად cookie
          ფაილების გამოყენებასთან დაკავშირებით.
        </Text>
        <Text>
          cookie არის მცირე ზომის მონაცემი, რომელიც იგზავნება ვებგვერდის
          სერვერიდან თქვენს პერსონალურ კომპიუტერზე, მობილურ ტელეფონზე ან სხვა
          სახის ელექტრონულ მოწყობილობაზე და ინახება ამ მოწყობილობის მყარ დისკზე.
          იგი აუცილებელია ვებგვერდის საბაზისო ფუნქციების მუშაობისთვის, ვებგვერძე
          ნავიგაციისთვის და მისი უსაფრთხო მოხმარებისთვის. ,,cookie" ფაილების
          მთავარი დანიშნულება არის ვებგვერძე თქვენს მიერ გაკეთებული არჩევანის
          დამახსოვრება, რაც შსაძლებელობას გაძლევთ ვებგვერძე შემდგომი
          ვიზიტებისას, ყოველ ჯერზე ხელახლა არ მოგიწიოთ არჩევანის გაკეთება.
          შესაბამისად, ჩვენი ვებგვერდის მიერ cookie ფაილების გამოყენების მიზანს
          წარმოადგენს მხოლოდ და მხოლოდ მომსახურების გაუმჯობესება და
          ონლაინშოპინგის თქვენთვის გამარტივება. ჩვენი ვებგვერდი არ იყენებს
          ანალიტიკური ხასიათის cookie ფაილებს თქვენს შესახებ პირადი ინფორმაციის
          შეგროვების მიზნით. თუმცა, გარკვეული დამუშავებული ინფორმაცია შეიძლება
          იყოს პირადი მონაცემი. მოგროვებული მონაცემები არ გადაეცემა მესამე
          პირებს, გარდა ჩვენი კონფიდენციალურობის პოლიტიკით განსაზღვრული
          შემთხვევებისა.
        </Text>
        <Text>
          თუ გსურთ, შეზღუდოთ ,cookie ფაილები ან დაბლოკოთ ისინი ჩვენს ვებგვერდზე,
          შეგიძლიათ თქვენი ბრაუზერის პარამეტრების შეცვლა. გთხოვთ,
          გაითვალისწინოთ, რომ ჩვენს მიერ შემოთავაზებული ზოგიერთი სერვისი არ
          იფუნქციონირებს თუ დაბლოკავთ ან წაშლით cookie ფაილებს.
        </Text>
        <Text>
          თქვენ შესაძლებლობა გაქვთ წაშალოთ cookie ფაილები თქვენს ელექტრონულ
          მოწყობილობაში არსებული ვებრაუზერის პარამეტრებიდან და ვებ-გვერძე
          ვიზიტისას ხელახლა მოხდება cookie პოლიტიკაზე თანხმობის მოთხოვნა.
        </Text>
        <Text>
          ვებგვერდით სარგებლობიასა თქვენ საშუალება გაქვთ დაეთანხმოთ cookies
          თანხმობის ღილაკზე დაჭერით. იმ შემთხვევაში თუ არ დაეთანხმებით cookie
          პოლიტიკას და გააგრძელებთ ვებგვერდით სარგებლობას, აღნიშნული ქმედება
          ჩაითვლება cookie პოლიტიკაზე თქვენ თანხმობად.
        </Text>
      </>
    ),
    "კონფიდენციალობის პოლიტიკა": (
      <>
        <Title>Cookie პოლიტიკა</Title>
        <Text>კონფიდენციალობის პოლიტიკა</Text>
        <Text>
          წინამდებარე კონფიდენციალობის პოლიტიკის კომპანიის ვებგვერდზე
          განთავსების მიზანია მოგაწოდოთ ინფორმაცია თქვენი პერსონალური
          მონაცემების დამუშავებისას ჩვენი მუშაობის პრინციპებისა და თქვენი
          სამართლებრივი დაცვის მექანიზმების შესახებ. წინამდებარე დოკუმენტი
          წარმოადგენს თქვენსა და კომპანიას შორის დადებულ სავალდებულო ძალის მქონე
          შეთანხმებას. ტერმინთა განმარტება
        </Text>
        <Text>
          დამუშავებაზე უფლებამოსილი პირი - იურიდიული პირს ან საჯარო
          დაწესებულებას, რომელიც მონაცემებს ამუშავებს ჩვენ ვებგვერდი -კომპანიის
          ვებგვერდი - megastore.ge, რომლის მეშვეობითაც ხდება მომხმარებელთა
          მომსახურება; მომხმარებელი/თქვენ - ფიზიკური პირი, რომელიც ვებგვერდზე
          რეგისტრაციის გზით ეთანხმება წინამდებარე დოკუმენტში დეკლარირებულ
          წესებსა და პირობებს ან/და აწარმოებს კომუნიკაციას კომპანიასთან,
          სარგებლობს, განიზრახა ან ინტერესი გამოხატა, რომ ესარგებლა ჩვენი
          პროდუქტით ან/და მომსახურებებით, ასევე წარმომადგენლებს ან მესამე
          პირებს, რომელთა შესახებაც თქვენ შეგვატყობინეთ;
        </Text>
        <Text>მონაცემთა სუბიექტი - მომხმარებელი/თქვენ;</Text>
        <Text>
          პერსონალური მონაცემები - სახელი, გვარი, პირადი ნომერი/პასპორტი ნომერი,
          ტელეფონის ნომერი, მისამართი, ელ.ფოსტა; მონაცემთა დამუშავება -
          მონაცემთა მიმართ კომპანიის მიერ (ან დამუშავებაზე უფლებამოსილი პირის
          მიერ) ინფორმაციული ტექნოლოგიების გამოყენებით ან მის გარეშე შესრულებულ
          ნებისმიერ მოქმედება, მათ შორის: მონაცემების შეგროვება, მოპოვება, მათზე
          წვდომა, ორგანიზება, დაჯგუფება, სისტემატიზაცია,, ურთიერთდაკავშირება,
          შენახვა, შეცვლა, აღდგენა, გამოთხოვა, გამოყენება, დაბლოკვა, წაშლა ან
          განადგურება, გამჟღავნება მათი გადაცემით ან სხვაგვარად ხელმისაწვდომად
          გახდომით; ლოგირება - მონაცემებზე წვდომის იდენტიფიცირება და აღრიცხვა,
          მონაცემთა მიმართ განხორციელებული ნებისმიერ ოპერაციაზე ავტომატურ
          რეჟიმში პასუხისმგებელი პირის იდენტიფიცირება და შენახვა (დათვალიერება,
          გადახვევა, გადმოწერა, წაშლა და ა.შ. დრო და სუბიექტი).
        </Text>
      </>
    ),
    "Tax Free": (
      <>
        <Title>Tax Free</Title>
        <Text>
          იშოპინგეთ "მეგაშოპში" და შეძენილ საქონელზე დაიბრუნეთ დღგ-ს თანხა -
          საქონლის ღირებულების 18% - შემოსავლების სამსახურის მომსახურების
          საფასურისა და ბანკის მიერ გაწეული მომსახურების საკომისიოს გამოკლებით.
        </Text>
        <Text>რას წარმოადგენს TAX FREE სერვისი?</Text>
        <Text>
          უცხო ქვეყნის მოქალაქის მიერ საქართველოში უფლებამოსილ სავაჭრო
          ობიექტებში შეძენილ საქონელზე გადახდილი დამატებული ღირებულების
          გადასახადის (დღგ) თანხის დაბრუნება, რომელიც იანგარიშება დარიცხული
          დღგ-ის თანხიდან - საქონლის ღირებულების 18% - შემოსავლების სამსახურის
          მომსახურების საფასურისა და ბანკის მიერ გაწეული მომსახურების საკომისიოს
          გამოკლებით. შემოსავლების სამსახურის მომსახურების საფასური შეადგენს
          საქონლის დღგ-ის გარეშე ღირებულების 4 %-ს, ხოლო ბანკის საკომისიო -
          დასაბრუნებელი დღგ-ის თანხის 3%-ს.
        </Text>
        <Text>
          დღგ-ის თანხის დაბრუნებისთვის აუცილებელი მოთხოვნების შესასრულებლად
          გთხოვთ დაგვიკავშირდეთ
        </Text>
      </>
    ),
  };
  const handleItemClick = (item: string) => {
    setSelectedItem(item);
    navigate(`/help/${encodeURIComponent(item)}`);
  };

  return (
    <HelpWrapper>
      <Container>
        <ListWrapper>
          {listItems.map((item, index) => (
            <ListItem
              key={index}
              onClick={() => handleItemClick(item)}
              tabIndex="0"
            >
              <img src={Arrow} alt="" />

              <Text paddingTop="0px">{item}</Text>
            </ListItem>
          ))}
        </ListWrapper>

        <TextWrapper>
          {contentMap[selectedItem] || <Text>Content not available</Text>}
        </TextWrapper>
      </Container>
    </HelpWrapper>
  );
}
